
// Написать сумму произвольного количества чисел
function getSum(){
  let result = null;
  for(let i = 0; i < arguments.length; i++){
    result += +arguments[i];
  }

  return result;
}

/*
Напишите функцию-конструктор Accumulator(startingValue).
Объект, который она создаёт, должен уметь следующее:
Хранить «текущее значение» в свойстве value. 
Начальное значение устанавливается в аргументе конструктора startingValue.
Метод read() использует prompt для получения числа и прибавляет его к свойству value.
Таким образом, свойство value является текущей суммой всего,
что ввёл пользователь при вызовах метода read(),
с учётом начального значения startingValue. 
*/